def count_letters(str):
    cnt = {}
    for ch in str:
        if ch.isalpha():
            ch = ch.lower()
            if ch in cnt:
                cnt[ch] += 1
            else:
                cnt[ch] = 1
    return cnt


def calculate_frequency(cnt):
    total = sum(cnt.values())
    new = {}
    for let, count in cnt.items():
        frequency = round(count / total, 2)
        new[let] = f"{frequency:.2f}"
    return new


main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

cnt = count_letters(main_str)
frequencies = calculate_frequency(cnt)

for let, frequencies in frequencies.items():
    print(f"{let}: {frequencies}")
